// 3-315 if문 - 2

#include <stdio.h>

int main(){
    puts("-------------------------------");
    puts("*if문 - 2*");
    puts("-------------------------------");

    if(0){
        puts("대한민국은 민주공화국이다.");
        puts("모든 주권은 국민으로부터 나온다.");
    }
    puts("한국은 월드컵 4강에 든 전설이 있다.");

    puts("-------------------------------");
    puts("블럭표시{}가 없으면 첫 번째 ; 까지만 해당");
    puts("블럭표시가 있으면 참이면 실행하고 거짓이면 지나감");    puts("0이나, 0.0은 거짓입니다. 논리로 따집니다.");
    puts("-------------------------------");

    return 0;
}
